<template>
    <div
        class="_container flex flex-col gap-5 sm:gap-6 xl:gap-[30px] 2xl:gap-10 py-[60px] sm:py-20 xl:py-[120px] 2xl:py-[200px] bg-gray-400">
        <h2>Ключевые практики</h2>
        <div v-for="(item, i) in blocks" :key="i" class="grid grid-cols-1 xl:grid-cols-2 gap-5 xl:gap-0">
            <div class="flex h-fit gap-2.5 sm:gap-4 xl:gap-[190px] 2xl:gap-[250px]">
                <span
                    class="bg-white rounded-full flex items-center justify-center w-12 h-12 sm:w-[50px] sm:h-[50px] 2xl:h-[60px] 2xl:w-[60px]">
                    <IconComponent :name="item.icon" />

                </span>
                <h3 class="xl:max-w-[470px] 2xl:max-w-[570px]">{{ item.title }}</h3>
            </div>
            <div class="flex items-start  flex-col gap-5 xl:gap-[30px] 2xl:gap-10">
                <ul class="flex flex-col gap-4 list-disc list-inside">
                    <li v-for="(listItem, i) in item.list" class="text-xs 2xl:text-base text-black">
                        {{ listItem }}
                    </li>
                </ul>
                <IconComponent name="arrow-right" />
                <button class="btn btn-main">решить проблему</button>
            </div>
        </div>
    </div>
</template>

<script setup>
const blocks = [
    {
        title: 'Таможня',
        icon: '',
        list: [
            'Сопровождение внешнеэкономических сделок', 'Разработка проектов в сфере ВЭД', 'Представление интересов доверителей в спорах с таможенными органами',
            'Обжалование корректировки таможенной стоимости', 'Представление интересов доверителей в делах об административных правонарушениях на таможне',
            'Обжалование классификации товаров по ТН ВЭД', 'Возврат таможенных платежей', 'Возврат сумм обеспечения', 'Взыскание убытков с таможенных органов'
        ],
        buttonClick: '',

    },
    {
        title: 'Налоги',
        icon: '',
        list: [
            'Представление интересов доверителей в налоговых органах', 'Выявление потенциальных налоговых рисков',
            'Разработка и внедрение налоговых стратегий', 'Представление интересов доверителей в спорах с налоговыми органами'
        ],
        buttonClick: '',

    },
    {
        title: 'Арбитражные споры',
        icon: '',
        list: [
            'Взыскание убытков, неосновательного обогащения', 'Банкротство, субсидиарная ответственность',
            'Защита права собственности', 'Коммерческие споры', 'Корпоративные споры', 'Строительные споры', 'Споры об интеллектуальной собственности'
        ],
        buttonClick: '',

    },
    {
        title: 'Споры по исполнению госконтрактов',
        icon: '',
        list: [
            'Обжалование решений ФАС в суде', 'Споры по реестру недобросовестных поставщиков', 'Споры по качеству товаров или работ/услуг',
            'Решение споров по срокам поставки и оплате товара или выполнения работ', 'Взыскание/снижение пеней, штрафов, убытков'
        ],
        buttonClick: '',

    },
    {
        title: 'Аудит юридических бизнес-процессов в компании',
        icon: '',
        list: [
            'Выявление рисков', 'Анализ эффективности работы юридической службы', 'Построение риск-ориентированной модели',
            'Разработка механизмов обеспечения безопасности', 'Разработка дорожной карты по приведению юридической службы к требуемой структуре'
        ],
        buttonClick: '',

    },
]
</script>